src/Catalogs/Релизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Релизы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРелиза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизВыпущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Релизы/Forms/ФормаЗаполненияГрафика/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальнаяВерсия = ПолучитьПоследнююВерсию();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююВерсию()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Релизы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Релизы КАК Релизы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Релизы.ДатаРелиза УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Релизы.ПустаяСсылка();
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура _Закрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	Оповестить("ОбновитьРелизы");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	ДатаНачала = НачальнаяВерсия.ДатаРелиза;
	НомерРелизаРазбивка = СтрРазделить(НачальнаяВерсия.Наименование, ".");
	НомерРелиза = Число(НомерРелизаРазбивка[1]);
	
	Для а = 1 По КоличествоВерсий Цикл
		НомерРелиза = НомерРелиза +1;
		НомерРелизаРазбивка[1] = Строка(НомерРелиза);
		
		ДатаОкончания = ДатаНачала + ИнтервалВыпускаРелиза * 24*60*60;
		ВзаимодействиеC_JIRA_КлиентСервер.СоздатьВерсию(СтрСоединить(НомерРелизаРазбивка, "."), ДатаНачала, ДатаОкончания);
		ДатаНачала = ДатаОкончания;
	КонецЦикла;
КонецПроцедуры
